---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadFrontProfile
source: html/4ae5ba37-2ac3-46c2-483c-556584c4a7ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadFrontProfile Property

"Nosing Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrTreadFrontProfile { get; }
```